virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/secumod.h
/*
 * Component description for SECUMOD
 *
 * Copyright (c) 2021 Microchip Technology Inc. and its subsidiaries.
 *
 * Subject to your compliance with these terms, you may use Microchip software and any derivatives
 * exclusively with Microchip products. It is your responsibility to comply with third party license
 * terms applicable to your use of third party software (including open source software) that may
 * accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES, WHETHER EXPRESS, IMPLIED OR STATUTORY,
 * APPLY TO THIS SOFTWARE, INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY, AND
 * FITNESS FOR A PARTICULAR PURPOSE.
 *
 * IN NO EVENT WILL MICROCHIP BE LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE SOFTWARE, HOWEVER CAUSED, EVEN IF
 * MICROCHIP HAS BEEN ADVISED OF THE POSSIBILITY OR THE DAMAGES ARE FORESEEABLE. TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY RELATED TO THIS SOFTWARE WILL NOT
 * EXCEED THE AMOUNT OF FEES, IF ANY, THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 */

/* file generated from device description version 2021-06-28T09:00:02Z */
#ifndef _SAMA5D2_SECUMOD_COMPONENT_H_
#define _SAMA5D2_SECUMOD_COMPONENT_H_

/* ************************************************************************** */
/*   SOFTWARE API DEFINITION FOR SECUMOD                                      */
/* ************************************************************************** */

/* -------- SECUMOD_CR : (SECUMOD Offset: 0x00) ( /W 32) Control Register -------- */
#define SECUMOD_CR_BACKUP_Pos                 _U_(0)                                               /**< (SECUMOD_CR) Backup Mode Position */
#define SECUMOD_CR_BACKUP_Msk                 (_U_(0x1) << SECUMOD_CR_BACKUP_Pos)                  /**< (SECUMOD_CR) Backup Mode Mask */
#define SECUMOD_CR_BACKUP(value)              (SECUMOD_CR_BACKUP_Msk & ((value) << SECUMOD_CR_BACKUP_Pos))
#define SECUMOD_CR_NORMAL_Pos                 _U_(1)                                               /**< (SECUMOD_CR) Normal Mode Position */
#define SECUMOD_CR_NORMAL_Msk                 (_U_(0x1) << SECUMOD_CR_NORMAL_Pos)                  /**< (SECUMOD_CR) Normal Mode Mask */
#define SECUMOD_CR_NORMAL(value)              (SECUMOD_CR_NORMAL_Msk & ((value) << SECUMOD_CR_NORMAL_Pos))
#define SECUMOD_CR_SWPROT_Pos                 _U_(2)                                               /**< (SECUMOD_CR) Software Protection Position */
#define SECUMOD_CR_SWPROT_Msk                 (_U_(0x1) << SECUMOD_CR_SWPROT_Pos)                  /**< (SECUMOD_CR) Software Protection Mask */
#define SECUMOD_CR_SWPROT(value)              (SECUMOD_CR_SWPROT_Msk & ((value) << SECUMOD_CR_SWPROT_Pos))
#define SECUMOD_CR_SCRAMB_Pos                 _U_(9)                                               /**< (SECUMOD_CR) Memory Scrambling Enable Position */
#define SECUMOD_CR_SCRAMB_Msk                 (_U_(0x3) << SECUMOD_CR_SCRAMB_Pos)                  /**< (SECUMOD_CR) Memory Scrambling Enable Mask */
#define SECUMOD_CR_SCRAMB(value)              (SECUMOD_CR_SCRAMB_Msk & ((value) << SECUMOD_CR_SCRAMB_Pos))
#define SECUMOD_CR_KEY_Pos                    _U_(16)                                              /**< (SECUMOD_CR) Password Position */
#define SECUMOD_CR_KEY_Msk                    (_U_(0xFFFF) << SECUMOD_CR_KEY_Pos)                  /**< (SECUMOD_CR) Password Mask */
#define SECUMOD_CR_KEY(value)                 (SECUMOD_CR_KEY_Msk & ((value) << SECUMOD_CR_KEY_Pos))
#define SECUMOD_CR_Msk                        _U_(0xFFFF0607)                                      /**< (SECUMOD_CR) Register Mask  */


/* -------- SECUMOD_SYSR : (SECUMOD Offset: 0x04) (R/W 32) System Status Register -------- */
#define SECUMOD_SYSR_ERASE_DONE_Pos           _U_(0)                                               /**< (SECUMOD_SYSR) Erasable Memories State (RW) Position */
#define SECUMOD_SYSR_ERASE_DONE_Msk           (_U_(0x1) << SECUMOD_SYSR_ERASE_DONE_Pos)            /**< (SECUMOD_SYSR) Erasable Memories State (RW) Mask */
#define SECUMOD_SYSR_ERASE_DONE(value)        (SECUMOD_SYSR_ERASE_DONE_Msk & ((value) << SECUMOD_SYSR_ERASE_DONE_Pos))
#define SECUMOD_SYSR_ERASE_ON_Pos             _U_(1)                                               /**< (SECUMOD_SYSR) Erase Process Ongoing (RO) Position */
#define SECUMOD_SYSR_ERASE_ON_Msk             (_U_(0x1) << SECUMOD_SYSR_ERASE_ON_Pos)              /**< (SECUMOD_SYSR) Erase Process Ongoing (RO) Mask */
#define SECUMOD_SYSR_ERASE_ON(value)          (SECUMOD_SYSR_ERASE_ON_Msk & ((value) << SECUMOD_SYSR_ERASE_ON_Pos))
#define SECUMOD_SYSR_BACKUP_Pos               _U_(2)                                               /**< (SECUMOD_SYSR) Backup Mode (RO) Position */
#define SECUMOD_SYSR_BACKUP_Msk               (_U_(0x1) << SECUMOD_SYSR_BACKUP_Pos)                /**< (SECUMOD_SYSR) Backup Mode (RO) Mask */
#define SECUMOD_SYSR_BACKUP(value)            (SECUMOD_SYSR_BACKUP_Msk & ((value) << SECUMOD_SYSR_BACKUP_Pos))
#define SECUMOD_SYSR_SWKUP_Pos                _U_(3)                                               /**< (SECUMOD_SYSR) SWKUP State (RO) Position */
#define SECUMOD_SYSR_SWKUP_Msk                (_U_(0x1) << SECUMOD_SYSR_SWKUP_Pos)                 /**< (SECUMOD_SYSR) SWKUP State (RO) Mask */
#define SECUMOD_SYSR_SWKUP(value)             (SECUMOD_SYSR_SWKUP_Msk & ((value) << SECUMOD_SYSR_SWKUP_Pos))
#define SECUMOD_SYSR_AUTOBKP_Pos              _U_(6)                                               /**< (SECUMOD_SYSR) Automatic Backup Mode Enabled (RO) Position */
#define SECUMOD_SYSR_AUTOBKP_Msk              (_U_(0x1) << SECUMOD_SYSR_AUTOBKP_Pos)               /**< (SECUMOD_SYSR) Automatic Backup Mode Enabled (RO) Mask */
#define SECUMOD_SYSR_AUTOBKP(value)           (SECUMOD_SYSR_AUTOBKP_Msk & ((value) << SECUMOD_SYSR_AUTOBKP_Pos))
#define SECUMOD_SYSR_SCRAMB_Pos               _U_(7)                                               /**< (SECUMOD_SYSR) Scrambling Enabled (RO) Position */
#define SECUMOD_SYSR_SCRAMB_Msk               (_U_(0x1) << SECUMOD_SYSR_SCRAMB_Pos)                /**< (SECUMOD_SYSR) Scrambling Enabled (RO) Mask */
#define SECUMOD_SYSR_SCRAMB(value)            (SECUMOD_SYSR_SCRAMB_Msk & ((value) << SECUMOD_SYSR_SCRAMB_Pos))
#define SECUMOD_SYSR_Msk                      _U_(0x000000CF)                                      /**< (SECUMOD_SYSR) Register Mask  */


/* -------- SECUMOD_SR : (SECUMOD Offset: 0x08) ( R/ 32) Status Register -------- */
#define SECUMOD_SR_DET0_Pos                   _U_(16)                                              /**< (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET0_Msk                   (_U_(0x1) << SECUMOD_SR_DET0_Pos)                    /**< (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET0(value)                (SECUMOD_SR_DET0_Msk & ((value) << SECUMOD_SR_DET0_Pos))
#define SECUMOD_SR_DET1_Pos                   _U_(17)                                              /**< (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET1_Msk                   (_U_(0x1) << SECUMOD_SR_DET1_Pos)                    /**< (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET1(value)                (SECUMOD_SR_DET1_Msk & ((value) << SECUMOD_SR_DET1_Pos))
#define SECUMOD_SR_DET2_Pos                   _U_(18)                                              /**< (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET2_Msk                   (_U_(0x1) << SECUMOD_SR_DET2_Pos)                    /**< (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET2(value)                (SECUMOD_SR_DET2_Msk & ((value) << SECUMOD_SR_DET2_Pos))
#define SECUMOD_SR_DET3_Pos                   _U_(19)                                              /**< (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET3_Msk                   (_U_(0x1) << SECUMOD_SR_DET3_Pos)                    /**< (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET3(value)                (SECUMOD_SR_DET3_Msk & ((value) << SECUMOD_SR_DET3_Pos))
#define SECUMOD_SR_DET4_Pos                   _U_(20)                                              /**< (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET4_Msk                   (_U_(0x1) << SECUMOD_SR_DET4_Pos)                    /**< (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET4(value)                (SECUMOD_SR_DET4_Msk & ((value) << SECUMOD_SR_DET4_Pos))
#define SECUMOD_SR_DET5_Pos                   _U_(21)                                              /**< (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET5_Msk                   (_U_(0x1) << SECUMOD_SR_DET5_Pos)                    /**< (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET5(value)                (SECUMOD_SR_DET5_Msk & ((value) << SECUMOD_SR_DET5_Pos))
#define SECUMOD_SR_DET6_Pos                   _U_(22)                                              /**< (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET6_Msk                   (_U_(0x1) << SECUMOD_SR_DET6_Pos)                    /**< (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET6(value)                (SECUMOD_SR_DET6_Msk & ((value) << SECUMOD_SR_DET6_Pos))
#define SECUMOD_SR_DET7_Pos                   _U_(23)                                              /**< (SECUMOD_SR) PIOBU Intrusion Detector Position */
#define SECUMOD_SR_DET7_Msk                   (_U_(0x1) << SECUMOD_SR_DET7_Pos)                    /**< (SECUMOD_SR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SR_DET7(value)                (SECUMOD_SR_DET7_Msk & ((value) << SECUMOD_SR_DET7_Pos))
#define SECUMOD_SR_Msk                        _U_(0x00FF0000)                                      /**< (SECUMOD_SR) Register Mask  */

#define SECUMOD_SR_DET_Pos                    _U_(16)                                              /**< (SECUMOD_SR Position) PIOBU Intrusion Detector */
#define SECUMOD_SR_DET_Msk                    (_U_(0xFF) << SECUMOD_SR_DET_Pos)                    /**< (SECUMOD_SR Mask) DET */
#define SECUMOD_SR_DET(value)                 (SECUMOD_SR_DET_Msk & ((value) << SECUMOD_SR_DET_Pos)) 

