virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/secumod.h
/* -------- SECUMOD_SCR : (SECUMOD Offset: 0x10) ( /W 32) Status Clear Register -------- */
#define SECUMOD_SCR_DET0_Pos                  _U_(16)                                              /**< (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET0_Msk                  (_U_(0x1) << SECUMOD_SCR_DET0_Pos)                   /**< (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET0(value)               (SECUMOD_SCR_DET0_Msk & ((value) << SECUMOD_SCR_DET0_Pos))
#define SECUMOD_SCR_DET1_Pos                  _U_(17)                                              /**< (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET1_Msk                  (_U_(0x1) << SECUMOD_SCR_DET1_Pos)                   /**< (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET1(value)               (SECUMOD_SCR_DET1_Msk & ((value) << SECUMOD_SCR_DET1_Pos))
#define SECUMOD_SCR_DET2_Pos                  _U_(18)                                              /**< (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET2_Msk                  (_U_(0x1) << SECUMOD_SCR_DET2_Pos)                   /**< (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET2(value)               (SECUMOD_SCR_DET2_Msk & ((value) << SECUMOD_SCR_DET2_Pos))
#define SECUMOD_SCR_DET3_Pos                  _U_(19)                                              /**< (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET3_Msk                  (_U_(0x1) << SECUMOD_SCR_DET3_Pos)                   /**< (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET3(value)               (SECUMOD_SCR_DET3_Msk & ((value) << SECUMOD_SCR_DET3_Pos))
#define SECUMOD_SCR_DET4_Pos                  _U_(20)                                              /**< (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET4_Msk                  (_U_(0x1) << SECUMOD_SCR_DET4_Pos)                   /**< (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET4(value)               (SECUMOD_SCR_DET4_Msk & ((value) << SECUMOD_SCR_DET4_Pos))
#define SECUMOD_SCR_DET5_Pos                  _U_(21)                                              /**< (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET5_Msk                  (_U_(0x1) << SECUMOD_SCR_DET5_Pos)                   /**< (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET5(value)               (SECUMOD_SCR_DET5_Msk & ((value) << SECUMOD_SCR_DET5_Pos))
#define SECUMOD_SCR_DET6_Pos                  _U_(22)                                              /**< (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET6_Msk                  (_U_(0x1) << SECUMOD_SCR_DET6_Pos)                   /**< (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET6(value)               (SECUMOD_SCR_DET6_Msk & ((value) << SECUMOD_SCR_DET6_Pos))
#define SECUMOD_SCR_DET7_Pos                  _U_(23)                                              /**< (SECUMOD_SCR) PIOBU Intrusion Detector Position */
#define SECUMOD_SCR_DET7_Msk                  (_U_(0x1) << SECUMOD_SCR_DET7_Pos)                   /**< (SECUMOD_SCR) PIOBU Intrusion Detector Mask */
#define SECUMOD_SCR_DET7(value)               (SECUMOD_SCR_DET7_Msk & ((value) << SECUMOD_SCR_DET7_Pos))
#define SECUMOD_SCR_Msk                       _U_(0x00FF0000)                                      /**< (SECUMOD_SCR) Register Mask  */

#define SECUMOD_SCR_DET_Pos                   _U_(16)                                              /**< (SECUMOD_SCR Position) PIOBU Intrusion Detector */
#define SECUMOD_SCR_DET_Msk                   (_U_(0xFF) << SECUMOD_SCR_DET_Pos)                   /**< (SECUMOD_SCR Mask) DET */
#define SECUMOD_SCR_DET(value)                (SECUMOD_SCR_DET_Msk & ((value) << SECUMOD_SCR_DET_Pos)) 

/* -------- SECUMOD_RAMRDY : (SECUMOD Offset: 0x14) ( R/ 32) RAM Access Ready Register -------- */
#define SECUMOD_RAMRDY_READY_Pos              _U_(0)                                               /**< (SECUMOD_RAMRDY) Ready for system access flag Position */
#define SECUMOD_RAMRDY_READY_Msk              (_U_(0x1) << SECUMOD_RAMRDY_READY_Pos)               /**< (SECUMOD_RAMRDY) Ready for system access flag Mask */
#define SECUMOD_RAMRDY_READY(value)           (SECUMOD_RAMRDY_READY_Msk & ((value) << SECUMOD_RAMRDY_READY_Pos))
#define SECUMOD_RAMRDY_Msk                    _U_(0x00000001)                                      /**< (SECUMOD_RAMRDY) Register Mask  */


/* -------- SECUMOD_PIOBU : (SECUMOD Offset: 0x18) (R/W 32) PIO Backup Register -------- */
#define SECUMOD_PIOBU_PIOBU_AFV_Pos           _U_(0)                                               /**< (SECUMOD_PIOBU) PIOBU Alarm Filter Value Position */
#define SECUMOD_PIOBU_PIOBU_AFV_Msk           (_U_(0xF) << SECUMOD_PIOBU_PIOBU_AFV_Pos)            /**< (SECUMOD_PIOBU) PIOBU Alarm Filter Value Mask */
#define SECUMOD_PIOBU_PIOBU_AFV(value)        (SECUMOD_PIOBU_PIOBU_AFV_Msk & ((value) << SECUMOD_PIOBU_PIOBU_AFV_Pos))
#define SECUMOD_PIOBU_PIOBU_RFV_Pos           _U_(4)                                               /**< (SECUMOD_PIOBU) PIOBUx Reset Filter Value Position */
#define SECUMOD_PIOBU_PIOBU_RFV_Msk           (_U_(0xF) << SECUMOD_PIOBU_PIOBU_RFV_Pos)            /**< (SECUMOD_PIOBU) PIOBUx Reset Filter Value Mask */
#define SECUMOD_PIOBU_PIOBU_RFV(value)        (SECUMOD_PIOBU_PIOBU_RFV_Msk & ((value) << SECUMOD_PIOBU_PIOBU_RFV_Pos))
#define SECUMOD_PIOBU_OUTPUT_Pos              _U_(8)                                               /**< (SECUMOD_PIOBU) Configure I/O Line in Input/Output Position */
#define SECUMOD_PIOBU_OUTPUT_Msk              (_U_(0x1) << SECUMOD_PIOBU_OUTPUT_Pos)               /**< (SECUMOD_PIOBU) Configure I/O Line in Input/Output Mask */
#define SECUMOD_PIOBU_OUTPUT(value)           (SECUMOD_PIOBU_OUTPUT_Msk & ((value) << SECUMOD_PIOBU_OUTPUT_Pos))
#define SECUMOD_PIOBU_PIO_SOD_Pos             _U_(9)                                               /**< (SECUMOD_PIOBU) Set/Clear the I/O Line when configured in Output Mode (OUTPUT =1) Position */
#define SECUMOD_PIOBU_PIO_SOD_Msk             (_U_(0x1) << SECUMOD_PIOBU_PIO_SOD_Pos)              /**< (SECUMOD_PIOBU) Set/Clear the I/O Line when configured in Output Mode (OUTPUT =1) Mask */
#define SECUMOD_PIOBU_PIO_SOD(value)          (SECUMOD_PIOBU_PIO_SOD_Msk & ((value) << SECUMOD_PIOBU_PIO_SOD_Pos))
#define SECUMOD_PIOBU_PIO_PDS_Pos             _U_(10)                                              /**< (SECUMOD_PIOBU) Level on the Pin in Input Mode (OUTPUT = 0) (Read-only) Position */
#define SECUMOD_PIOBU_PIO_PDS_Msk             (_U_(0x1) << SECUMOD_PIOBU_PIO_PDS_Pos)              /**< (SECUMOD_PIOBU) Level on the Pin in Input Mode (OUTPUT = 0) (Read-only) Mask */
#define SECUMOD_PIOBU_PIO_PDS(value)          (SECUMOD_PIOBU_PIO_PDS_Msk & ((value) << SECUMOD_PIOBU_PIO_PDS_Pos))
#define SECUMOD_PIOBU_PULLUP_Pos              _U_(12)                                              /**< (SECUMOD_PIOBU) Programmable Pull-up State Position */
#define SECUMOD_PIOBU_PULLUP_Msk              (_U_(0x3) << SECUMOD_PIOBU_PULLUP_Pos)               /**< (SECUMOD_PIOBU) Programmable Pull-up State Mask */
#define SECUMOD_PIOBU_PULLUP(value)           (SECUMOD_PIOBU_PULLUP_Msk & ((value) << SECUMOD_PIOBU_PULLUP_Pos))
#define SECUMOD_PIOBU_SCHEDULE_Pos            _U_(14)                                              /**< (SECUMOD_PIOBU) Pull-up/Down Scheduled Position */
#define SECUMOD_PIOBU_SCHEDULE_Msk            (_U_(0x1) << SECUMOD_PIOBU_SCHEDULE_Pos)             /**< (SECUMOD_PIOBU) Pull-up/Down Scheduled Mask */
#define SECUMOD_PIOBU_SCHEDULE(value)         (SECUMOD_PIOBU_SCHEDULE_Msk & ((value) << SECUMOD_PIOBU_SCHEDULE_Pos))
#define SECUMOD_PIOBU_SWITCH_Pos              _U_(15)                                              /**< (SECUMOD_PIOBU) Switch State for Intrusion Detection Position */
#define SECUMOD_PIOBU_SWITCH_Msk              (_U_(0x1) << SECUMOD_PIOBU_SWITCH_Pos)               /**< (SECUMOD_PIOBU) Switch State for Intrusion Detection Mask */
#define SECUMOD_PIOBU_SWITCH(value)           (SECUMOD_PIOBU_SWITCH_Msk & ((value) << SECUMOD_PIOBU_SWITCH_Pos))
#define SECUMOD_PIOBU_Msk                     _U_(0x0000F7FF)                                      /**< (SECUMOD_PIOBU) Register Mask  */


