virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/secumod.h
/* -------- SECUMOD_JTAGCR : (SECUMOD Offset: 0x68) (R/W 32) JTAG Protection Control Register -------- */
#define SECUMOD_JTAGCR_FNTRST_Pos             _U_(0)                                               /**< (SECUMOD_JTAGCR) Force NTRST Position */
#define SECUMOD_JTAGCR_FNTRST_Msk             (_U_(0x1) << SECUMOD_JTAGCR_FNTRST_Pos)              /**< (SECUMOD_JTAGCR) Force NTRST Mask */
#define SECUMOD_JTAGCR_FNTRST(value)          (SECUMOD_JTAGCR_FNTRST_Msk & ((value) << SECUMOD_JTAGCR_FNTRST_Pos))
#define SECUMOD_JTAGCR_CA5_DEBUG_MODE_Pos     _U_(1)                                               /**< (SECUMOD_JTAGCR) Cortex-A5 Invasive/Non-Invasive Secure/Non-Secure Debug Permissions Position */
#define SECUMOD_JTAGCR_CA5_DEBUG_MODE_Msk     (_U_(0x7) << SECUMOD_JTAGCR_CA5_DEBUG_MODE_Pos)      /**< (SECUMOD_JTAGCR) Cortex-A5 Invasive/Non-Invasive Secure/Non-Secure Debug Permissions Mask */
#define SECUMOD_JTAGCR_CA5_DEBUG_MODE(value)  (SECUMOD_JTAGCR_CA5_DEBUG_MODE_Msk & ((value) << SECUMOD_JTAGCR_CA5_DEBUG_MODE_Pos))
#define SECUMOD_JTAGCR_WZO_Pos                _U_(4)                                               /**< (SECUMOD_JTAGCR) Write ZERO Position */
#define SECUMOD_JTAGCR_WZO_Msk                (_U_(0x1) << SECUMOD_JTAGCR_WZO_Pos)                 /**< (SECUMOD_JTAGCR) Write ZERO Mask */
#define SECUMOD_JTAGCR_WZO(value)             (SECUMOD_JTAGCR_WZO_Msk & ((value) << SECUMOD_JTAGCR_WZO_Pos))
#define SECUMOD_JTAGCR_Msk                    _U_(0x0000001F)                                      /**< (SECUMOD_JTAGCR) Register Mask  */


/* -------- SECUMOD_SCRKEY : (SECUMOD Offset: 0x70) (R/W 32) Scrambling Key Register -------- */
#define SECUMOD_SCRKEY_SCRKEY_Pos             _U_(0)                                               /**< (SECUMOD_SCRKEY) Scrambling Key Value Position */
#define SECUMOD_SCRKEY_SCRKEY_Msk             (_U_(0xFFFFFFFF) << SECUMOD_SCRKEY_SCRKEY_Pos)       /**< (SECUMOD_SCRKEY) Scrambling Key Value Mask */
#define SECUMOD_SCRKEY_SCRKEY(value)          (SECUMOD_SCRKEY_SCRKEY_Msk & ((value) << SECUMOD_SCRKEY_SCRKEY_Pos))
#define SECUMOD_SCRKEY_Msk                    _U_(0xFFFFFFFF)                                      /**< (SECUMOD_SCRKEY) Register Mask  */


/* -------- SECUMOD_RAMACC : (SECUMOD Offset: 0x74) (R/W 32) RAM Access Rights Register -------- */
#define SECUMOD_RAMACC_RW0_Pos                _U_(0)                                               /**< (SECUMOD_RAMACC) Access right for RAM region [0; 1 Kbyte] Position */
#define SECUMOD_RAMACC_RW0_Msk                (_U_(0x3) << SECUMOD_RAMACC_RW0_Pos)                 /**< (SECUMOD_RAMACC) Access right for RAM region [0; 1 Kbyte] Mask */
#define SECUMOD_RAMACC_RW0(value)             (SECUMOD_RAMACC_RW0_Msk & ((value) << SECUMOD_RAMACC_RW0_Pos))
#define SECUMOD_RAMACC_RW1_Pos                _U_(2)                                               /**< (SECUMOD_RAMACC) Access right for RAM region [1 Kbyte; 2 Kbytes] Position */
#define SECUMOD_RAMACC_RW1_Msk                (_U_(0x3) << SECUMOD_RAMACC_RW1_Pos)                 /**< (SECUMOD_RAMACC) Access right for RAM region [1 Kbyte; 2 Kbytes] Mask */
#define SECUMOD_RAMACC_RW1(value)             (SECUMOD_RAMACC_RW1_Msk & ((value) << SECUMOD_RAMACC_RW1_Pos))
#define SECUMOD_RAMACC_RW2_Pos                _U_(4)                                               /**< (SECUMOD_RAMACC) Access right for RAM region [2 Kbytes; 3 Kbytes] Position */
#define SECUMOD_RAMACC_RW2_Msk                (_U_(0x3) << SECUMOD_RAMACC_RW2_Pos)                 /**< (SECUMOD_RAMACC) Access right for RAM region [2 Kbytes; 3 Kbytes] Mask */
#define SECUMOD_RAMACC_RW2(value)             (SECUMOD_RAMACC_RW2_Msk & ((value) << SECUMOD_RAMACC_RW2_Pos))
#define SECUMOD_RAMACC_RW3_Pos                _U_(6)                                               /**< (SECUMOD_RAMACC) Access right for RAM region [3 Kbytes; 4 Kbytes] Position */
#define SECUMOD_RAMACC_RW3_Msk                (_U_(0x3) << SECUMOD_RAMACC_RW3_Pos)                 /**< (SECUMOD_RAMACC) Access right for RAM region [3 Kbytes; 4 Kbytes] Mask */
#define SECUMOD_RAMACC_RW3(value)             (SECUMOD_RAMACC_RW3_Msk & ((value) << SECUMOD_RAMACC_RW3_Pos))
#define SECUMOD_RAMACC_RW4_Pos                _U_(8)                                               /**< (SECUMOD_RAMACC) Access right for RAM region [4 Kbytes; 5 Kbytes] Position */
#define SECUMOD_RAMACC_RW4_Msk                (_U_(0x3) << SECUMOD_RAMACC_RW4_Pos)                 /**< (SECUMOD_RAMACC) Access right for RAM region [4 Kbytes; 5 Kbytes] Mask */
#define SECUMOD_RAMACC_RW4(value)             (SECUMOD_RAMACC_RW4_Msk & ((value) << SECUMOD_RAMACC_RW4_Pos))
#define SECUMOD_RAMACC_RW5_Pos                _U_(10)                                              /**< (SECUMOD_RAMACC) Access right for RAM region [5 Kbytes; 6 Kbytes] (register bank BUREG256b) Position */
#define SECUMOD_RAMACC_RW5_Msk                (_U_(0x3) << SECUMOD_RAMACC_RW5_Pos)                 /**< (SECUMOD_RAMACC) Access right for RAM region [5 Kbytes; 6 Kbytes] (register bank BUREG256b) Mask */
#define SECUMOD_RAMACC_RW5(value)             (SECUMOD_RAMACC_RW5_Msk & ((value) << SECUMOD_RAMACC_RW5_Pos))
#define SECUMOD_RAMACC_Msk                    _U_(0x00000FFF)                                      /**< (SECUMOD_RAMACC) Register Mask  */


/* -------- SECUMOD_RAMACCSR : (SECUMOD Offset: 0x78) (R/W 32) RAM Access Rights Status Register -------- */
#define SECUMOD_RAMACCSR_RW0_Pos              _U_(0)                                               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [0; 1 Kbyte] Position */
#define SECUMOD_RAMACCSR_RW0_Msk              (_U_(0x3) << SECUMOD_RAMACCSR_RW0_Pos)               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [0; 1 Kbyte] Mask */
#define SECUMOD_RAMACCSR_RW0(value)           (SECUMOD_RAMACCSR_RW0_Msk & ((value) << SECUMOD_RAMACCSR_RW0_Pos))
#define SECUMOD_RAMACCSR_RW1_Pos              _U_(2)                                               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [1 Kbytes; 2 Kbytes] Position */
#define SECUMOD_RAMACCSR_RW1_Msk              (_U_(0x3) << SECUMOD_RAMACCSR_RW1_Pos)               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [1 Kbytes; 2 Kbytes] Mask */
#define SECUMOD_RAMACCSR_RW1(value)           (SECUMOD_RAMACCSR_RW1_Msk & ((value) << SECUMOD_RAMACCSR_RW1_Pos))
#define SECUMOD_RAMACCSR_RW2_Pos              _U_(4)                                               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [2 Kbytes; 3 Kbytes] Position */
#define SECUMOD_RAMACCSR_RW2_Msk              (_U_(0x3) << SECUMOD_RAMACCSR_RW2_Pos)               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [2 Kbytes; 3 Kbytes] Mask */
#define SECUMOD_RAMACCSR_RW2(value)           (SECUMOD_RAMACCSR_RW2_Msk & ((value) << SECUMOD_RAMACCSR_RW2_Pos))
#define SECUMOD_RAMACCSR_RW3_Pos              _U_(6)                                               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [3 Kbytes; 4 Kbytes] Position */
#define SECUMOD_RAMACCSR_RW3_Msk              (_U_(0x3) << SECUMOD_RAMACCSR_RW3_Pos)               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [3 Kbytes; 4 Kbytes] Mask */
#define SECUMOD_RAMACCSR_RW3(value)           (SECUMOD_RAMACCSR_RW3_Msk & ((value) << SECUMOD_RAMACCSR_RW3_Pos))
#define SECUMOD_RAMACCSR_RW4_Pos              _U_(8)                                               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [4 Kbytes; 5 Kbytes] Position */
#define SECUMOD_RAMACCSR_RW4_Msk              (_U_(0x3) << SECUMOD_RAMACCSR_RW4_Pos)               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [4 Kbytes; 5 Kbytes] Mask */
#define SECUMOD_RAMACCSR_RW4(value)           (SECUMOD_RAMACCSR_RW4_Msk & ((value) << SECUMOD_RAMACCSR_RW4_Pos))
#define SECUMOD_RAMACCSR_RW5_Pos              _U_(10)                                              /**< (SECUMOD_RAMACCSR) Access right status for RAM region [5 Kbytes; 6 Kbytes] (register bank BUREG256b) Position */
#define SECUMOD_RAMACCSR_RW5_Msk              (_U_(0x3) << SECUMOD_RAMACCSR_RW5_Pos)               /**< (SECUMOD_RAMACCSR) Access right status for RAM region [5 Kbytes; 6 Kbytes] (register bank BUREG256b) Mask */
#define SECUMOD_RAMACCSR_RW5(value)           (SECUMOD_RAMACCSR_RW5_Msk & ((value) << SECUMOD_RAMACCSR_RW5_Pos))
#define SECUMOD_RAMACCSR_Msk                  _U_(0x00000FFF)                                      /**< (SECUMOD_RAMACCSR) Register Mask  */


/* -------- SECUMOD_BMPR : (SECUMOD Offset: 0x7C) (R/W 32) Backup Mode Protection Register -------- */
#define SECUMOD_BMPR_DET0_Pos                 _U_(16)                                              /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_BMPR_DET0_Msk                 (_U_(0x1) << SECUMOD_BMPR_DET0_Pos)                  /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_BMPR_DET0(value)              (SECUMOD_BMPR_DET0_Msk & ((value) << SECUMOD_BMPR_DET0_Pos))
#define SECUMOD_BMPR_DET1_Pos                 _U_(17)                                              /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_BMPR_DET1_Msk                 (_U_(0x1) << SECUMOD_BMPR_DET1_Pos)                  /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_BMPR_DET1(value)              (SECUMOD_BMPR_DET1_Msk & ((value) << SECUMOD_BMPR_DET1_Pos))
#define SECUMOD_BMPR_DET2_Pos                 _U_(18)                                              /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_BMPR_DET2_Msk                 (_U_(0x1) << SECUMOD_BMPR_DET2_Pos)                  /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_BMPR_DET2(value)              (SECUMOD_BMPR_DET2_Msk & ((value) << SECUMOD_BMPR_DET2_Pos))
#define SECUMOD_BMPR_DET3_Pos                 _U_(19)                                              /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_BMPR_DET3_Msk                 (_U_(0x1) << SECUMOD_BMPR_DET3_Pos)                  /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_BMPR_DET3(value)              (SECUMOD_BMPR_DET3_Msk & ((value) << SECUMOD_BMPR_DET3_Pos))
#define SECUMOD_BMPR_DET4_Pos                 _U_(20)                                              /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_BMPR_DET4_Msk                 (_U_(0x1) << SECUMOD_BMPR_DET4_Pos)                  /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_BMPR_DET4(value)              (SECUMOD_BMPR_DET4_Msk & ((value) << SECUMOD_BMPR_DET4_Pos))
#define SECUMOD_BMPR_DET5_Pos                 _U_(21)                                              /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_BMPR_DET5_Msk                 (_U_(0x1) << SECUMOD_BMPR_DET5_Pos)                  /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_BMPR_DET5(value)              (SECUMOD_BMPR_DET5_Msk & ((value) << SECUMOD_BMPR_DET5_Pos))
#define SECUMOD_BMPR_DET6_Pos                 _U_(22)                                              /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_BMPR_DET6_Msk                 (_U_(0x1) << SECUMOD_BMPR_DET6_Pos)                  /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_BMPR_DET6(value)              (SECUMOD_BMPR_DET6_Msk & ((value) << SECUMOD_BMPR_DET6_Pos))
#define SECUMOD_BMPR_DET7_Pos                 _U_(23)                                              /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_BMPR_DET7_Msk                 (_U_(0x1) << SECUMOD_BMPR_DET7_Pos)                  /**< (SECUMOD_BMPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_BMPR_DET7(value)              (SECUMOD_BMPR_DET7_Msk & ((value) << SECUMOD_BMPR_DET7_Pos))
#define SECUMOD_BMPR_Msk                      _U_(0x00FF0000)                                      /**< (SECUMOD_BMPR) Register Mask  */

#define SECUMOD_BMPR_DET_Pos                  _U_(16)                                              /**< (SECUMOD_BMPR Position) PIOBU Intrusion Detector Protection */
#define SECUMOD_BMPR_DET_Msk                  (_U_(0xFF) << SECUMOD_BMPR_DET_Pos)                  /**< (SECUMOD_BMPR Mask) DET */
#define SECUMOD_BMPR_DET(value)               (SECUMOD_BMPR_DET_Msk & ((value) << SECUMOD_BMPR_DET_Pos)) 

