virtualabs/cutcutgo/src/packs/ATSAMA5D27_DFP/component/secumod.h
/* -------- SECUMOD_NIMPR : (SECUMOD Offset: 0x8C) ( R/ 32) Normal Interrupt Mask Protection Register -------- */
#define SECUMOD_NIMPR_DET0_Pos                _U_(16)                                              /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Position */
#define SECUMOD_NIMPR_DET0_Msk                (_U_(0x1) << SECUMOD_NIMPR_DET0_Pos)                 /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Mask */
#define SECUMOD_NIMPR_DET0(value)             (SECUMOD_NIMPR_DET0_Msk & ((value) << SECUMOD_NIMPR_DET0_Pos))
#define SECUMOD_NIMPR_DET1_Pos                _U_(17)                                              /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Position */
#define SECUMOD_NIMPR_DET1_Msk                (_U_(0x1) << SECUMOD_NIMPR_DET1_Pos)                 /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Mask */
#define SECUMOD_NIMPR_DET1(value)             (SECUMOD_NIMPR_DET1_Msk & ((value) << SECUMOD_NIMPR_DET1_Pos))
#define SECUMOD_NIMPR_DET2_Pos                _U_(18)                                              /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Position */
#define SECUMOD_NIMPR_DET2_Msk                (_U_(0x1) << SECUMOD_NIMPR_DET2_Pos)                 /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Mask */
#define SECUMOD_NIMPR_DET2(value)             (SECUMOD_NIMPR_DET2_Msk & ((value) << SECUMOD_NIMPR_DET2_Pos))
#define SECUMOD_NIMPR_DET3_Pos                _U_(19)                                              /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Position */
#define SECUMOD_NIMPR_DET3_Msk                (_U_(0x1) << SECUMOD_NIMPR_DET3_Pos)                 /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Mask */
#define SECUMOD_NIMPR_DET3(value)             (SECUMOD_NIMPR_DET3_Msk & ((value) << SECUMOD_NIMPR_DET3_Pos))
#define SECUMOD_NIMPR_DET4_Pos                _U_(20)                                              /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Position */
#define SECUMOD_NIMPR_DET4_Msk                (_U_(0x1) << SECUMOD_NIMPR_DET4_Pos)                 /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Mask */
#define SECUMOD_NIMPR_DET4(value)             (SECUMOD_NIMPR_DET4_Msk & ((value) << SECUMOD_NIMPR_DET4_Pos))
#define SECUMOD_NIMPR_DET5_Pos                _U_(21)                                              /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Position */
#define SECUMOD_NIMPR_DET5_Msk                (_U_(0x1) << SECUMOD_NIMPR_DET5_Pos)                 /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Mask */
#define SECUMOD_NIMPR_DET5(value)             (SECUMOD_NIMPR_DET5_Msk & ((value) << SECUMOD_NIMPR_DET5_Pos))
#define SECUMOD_NIMPR_DET6_Pos                _U_(22)                                              /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Position */
#define SECUMOD_NIMPR_DET6_Msk                (_U_(0x1) << SECUMOD_NIMPR_DET6_Pos)                 /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Mask */
#define SECUMOD_NIMPR_DET6(value)             (SECUMOD_NIMPR_DET6_Msk & ((value) << SECUMOD_NIMPR_DET6_Pos))
#define SECUMOD_NIMPR_DET7_Pos                _U_(23)                                              /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Position */
#define SECUMOD_NIMPR_DET7_Msk                (_U_(0x1) << SECUMOD_NIMPR_DET7_Pos)                 /**< (SECUMOD_NIMPR) PIOBU Intrusion Detector Protection Interrupt Mask Mask */
#define SECUMOD_NIMPR_DET7(value)             (SECUMOD_NIMPR_DET7_Msk & ((value) << SECUMOD_NIMPR_DET7_Pos))
#define SECUMOD_NIMPR_Msk                     _U_(0x00FF0000)                                      /**< (SECUMOD_NIMPR) Register Mask  */

#define SECUMOD_NIMPR_DET_Pos                 _U_(16)                                              /**< (SECUMOD_NIMPR Position) PIOBU Intrusion Detector Protection Interrupt Mask */
#define SECUMOD_NIMPR_DET_Msk                 (_U_(0xFF) << SECUMOD_NIMPR_DET_Pos)                 /**< (SECUMOD_NIMPR Mask) DET */
#define SECUMOD_NIMPR_DET(value)              (SECUMOD_NIMPR_DET_Msk & ((value) << SECUMOD_NIMPR_DET_Pos)) 

/* -------- SECUMOD_WKPR : (SECUMOD Offset: 0x90) (R/W 32) Wakeup Protection Register -------- */
#define SECUMOD_WKPR_DET0_Pos                 _U_(16)                                              /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_WKPR_DET0_Msk                 (_U_(0x1) << SECUMOD_WKPR_DET0_Pos)                  /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_WKPR_DET0(value)              (SECUMOD_WKPR_DET0_Msk & ((value) << SECUMOD_WKPR_DET0_Pos))
#define SECUMOD_WKPR_DET1_Pos                 _U_(17)                                              /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_WKPR_DET1_Msk                 (_U_(0x1) << SECUMOD_WKPR_DET1_Pos)                  /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_WKPR_DET1(value)              (SECUMOD_WKPR_DET1_Msk & ((value) << SECUMOD_WKPR_DET1_Pos))
#define SECUMOD_WKPR_DET2_Pos                 _U_(18)                                              /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_WKPR_DET2_Msk                 (_U_(0x1) << SECUMOD_WKPR_DET2_Pos)                  /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_WKPR_DET2(value)              (SECUMOD_WKPR_DET2_Msk & ((value) << SECUMOD_WKPR_DET2_Pos))
#define SECUMOD_WKPR_DET3_Pos                 _U_(19)                                              /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_WKPR_DET3_Msk                 (_U_(0x1) << SECUMOD_WKPR_DET3_Pos)                  /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_WKPR_DET3(value)              (SECUMOD_WKPR_DET3_Msk & ((value) << SECUMOD_WKPR_DET3_Pos))
#define SECUMOD_WKPR_DET4_Pos                 _U_(20)                                              /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_WKPR_DET4_Msk                 (_U_(0x1) << SECUMOD_WKPR_DET4_Pos)                  /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_WKPR_DET4(value)              (SECUMOD_WKPR_DET4_Msk & ((value) << SECUMOD_WKPR_DET4_Pos))
#define SECUMOD_WKPR_DET5_Pos                 _U_(21)                                              /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_WKPR_DET5_Msk                 (_U_(0x1) << SECUMOD_WKPR_DET5_Pos)                  /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_WKPR_DET5(value)              (SECUMOD_WKPR_DET5_Msk & ((value) << SECUMOD_WKPR_DET5_Pos))
#define SECUMOD_WKPR_DET6_Pos                 _U_(22)                                              /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_WKPR_DET6_Msk                 (_U_(0x1) << SECUMOD_WKPR_DET6_Pos)                  /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_WKPR_DET6(value)              (SECUMOD_WKPR_DET6_Msk & ((value) << SECUMOD_WKPR_DET6_Pos))
#define SECUMOD_WKPR_DET7_Pos                 _U_(23)                                              /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Position */
#define SECUMOD_WKPR_DET7_Msk                 (_U_(0x1) << SECUMOD_WKPR_DET7_Pos)                  /**< (SECUMOD_WKPR) PIOBU Intrusion Detector Protection Mask */
#define SECUMOD_WKPR_DET7(value)              (SECUMOD_WKPR_DET7_Msk & ((value) << SECUMOD_WKPR_DET7_Pos))
#define SECUMOD_WKPR_Msk                      _U_(0x00FF0000)                                      /**< (SECUMOD_WKPR) Register Mask  */

#define SECUMOD_WKPR_DET_Pos                  _U_(16)                                              /**< (SECUMOD_WKPR Position) PIOBU Intrusion Detector Protection */
#define SECUMOD_WKPR_DET_Msk                  (_U_(0xFF) << SECUMOD_WKPR_DET_Pos)                  /**< (SECUMOD_WKPR Mask) DET */
#define SECUMOD_WKPR_DET(value)               (SECUMOD_WKPR_DET_Msk & ((value) << SECUMOD_WKPR_DET_Pos)) 

